In [1]:
print('hello')

hello

In [40]:
import pandas as pd
%pylab inline

unames = ['user_id','gender','age','occupation','zip']
users  = pd.read_table('../data/movielens/users.dat',sep='::',header=None,names=unames,engine='python')
rnames = ['user_id','movie_id','rating','timestamp']
ratings = pd.read_table('../data/movielens/ratings.dat',sep='::',header=None,names=rnames,engine='python')
mnames = ['movie_id','title','genres']
movies = pd.read_table('../data/movielens/movies.dat',sep='::',header=None,names=mnames,engine='python')
users[:5]

Populating the interactive namespace from numpy and matplotlib

   user_id gender  age  occupation    zip
0        1      F    1          10  48067
1        2      M   56          16  70072
2        3      M   25          15  55117
3        4      M   45           7  02460
4        5      M   25          20  55455

In [41]:
ratings[:5]

   user_id  movie_id  rating  timestamp
0        1      1193       5  978300760
1        1       661       3  978302109
2        1       914       3  978301968
3        1      3408       4  978300275
4        1      2355       5  978824291

In [42]:
movies[:5]

   movie_id                               title                        genres
0         1                    Toy Story (1995)   Animation|Children's|Comedy
1         2                      Jumanji (1995)  Adventure|Children's|Fantasy
2         3             Grumpier Old Men (1995)                Comedy|Romance
3         4            Waiting to Exhale (1995)                  Comedy|Drama
4         5  Father of the Bride Part II (1995)                        Comedy

In [45]:
data = pd.merge(pd.merge(ratings,users),movies)

In [46]:
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [31]:
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,titile,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [15]:
data.ix[0]

/home/kongweikun/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#deprecate_ix
  """Entry point for launching an IPython kernel.

user_id                                            1
movie_id                                        1193
rating                                             5
timestamp                                  978300760
gender                                             F
age                                                1
occupation                                        10
zip                                            48067
ttile         One Flew Over the Cuckoo's Nest (1975)
genres                                         Drama
Name: 0, dtype: object

In [16]:
mean_ratings = data.privot_table('rating',rows='title',cols='gender',aggfunc='mean')

AttributeError: 'DataFrame' object has no attribute 'privot_table'

In [17]:
mean_ratings = data.pivot_table('rating',rows='title',cols='gender',aggfunc='mean')

TypeError: pivot_table() got an unexpected keyword argument 'rows'

In [18]:
mean_ratings = data.pivot_table('rating',row='title',cols='gender',aggfunc='mean')

TypeError: pivot_table() got an unexpected keyword argument 'row'

In [19]:
mean_ratings = data.pivot_table('rating', rows='title',cols='gender',aggfunc=
                               'mean')

TypeError: pivot_table() got an unexpected keyword argument 'rows'

In [20]:
mean_ratings = data.pivot_table('rating', index='title',values='gender',aggfunc=
                               'mean')

TypeError: pivot_table() got multiple values for argument 'values'

In [21]:
mean_ratings = data.pivot_table('rating', index='title',cols='gender',aggfunc=
                               'mean')

TypeError: pivot_table() got an unexpected keyword argument 'cols'

In [22]:
mean_ratings = data.pivot_table('rating', index='title',columns='gender',aggfunc=
                               'mean')

KeyError: 'title'

In [23]:
mean_ratings = data.pivot_table('rating', index=['title'],columns='gender',aggfunc=
                               'mean')

KeyError: 'title'

In [44]:
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,titile,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [34]:
mean_ratings = data.pivot_table('rating', index=['titile'],columns='gender',aggfunc=
                               'mean')

In [47]:
data[:5]

,user_id,movie_id,rating,timestamp,gender,age,occupation,zip,title,genres
0,1,1193,5,978300760,F,1,10,48067,One Flew Over the Cuckoo's Nest (1975),Drama
1,2,1193,5,978298413,M,56,16,70072,One Flew Over the Cuckoo's Nest (1975),Drama
2,12,1193,4,978220179,M,25,12,32793,One Flew Over the Cuckoo's Nest (1975),Drama
3,15,1193,4,978199279,M,25,7,22903,One Flew Over the Cuckoo's Nest (1975),Drama
4,17,1193,5,978158471,M,50,1,95350,One Flew Over the Cuckoo's Nest (1975),Drama

In [50]:
mean_ratings = data.pivot_table('rating', index='title',columns='gender',aggfunc=
                               'mean')

In [51]:
mean_ratings[:5]

gender                                F         M
title
$1,000,000 Duck (1971)         3.375000  2.761905
'Night Mother (1986)           3.388889  3.352941
'Til There Was You (1997)      2.675676  2.733333
'burbs, The (1989)             2.793478  2.962085
...And Justice for All (1979)  3.828571  3.689024

In [52]:
rating_by_title = data.groupby('title').size()

In [62]:
rating_by_title[:5]

title
Zed & Two Noughts, A (1985)                    29
Zero Effect (1998)                            301
Zero Kelvin (Kjrlighetens kjtere) (1995)      2
Zeus and Roxanne (1997)                        23
eXistenZ (1999)                               410
dtype: int64

In [59]:
active_titles = rating_by_title.index[rating_by_title>=250]

In [61]:
active_titles[:5]

Index([''burbs, The (1989)', '10 Things I Hate About You (1999)',
       '101 Dalmatians (1961)', '101 Dalmatians (1996)',
       '12 Angry Men (1957)'],
      dtype='object', name='title')

American Beauty (1999)                                   3428
Star Wars: Episode IV - A New Hope (1977)                2991
Star Wars: Episode V - The Empire Strikes Back (1980)    2990
Star Wars: Episode VI - Return of the Jedi (1983)        2883
Jurassic Park (1993)                                     2672
Saving Private Ryan (1998)                               2653
Terminator 2: Judgment Day (1991)                        2649
Matrix, The (1999)                                       2590
Back to the Future (1985)                                2583
Silence of the Lambs, The (1991)                         2578
Men in Black (1997)                                      2538
Raiders of the Lost Ark (1981)                           2514
Fargo (1996)                                             2513
Sixth Sense, The (1999)                                  2459
Braveheart (1995)                                        2443
Shakespeare in Love (1998)                               2369
Princess Bride, The (1987)                               2318
Schindler's List (1993)                                  2304
L.A. Confidential (1997)                                 2288
Groundhog Day (1993)                                     2278
E.T. the Extra-Terrestrial (1982)                        2269
Star Wars: Episode I - The Phantom Menace (1999)         2250
Being John Malkovich (1999)                              2241
Shawshank Redemption, The (1994)                         2227
Godfather, The (1972)                                    2223
Forrest Gump (1994)                                      2194
Ghostbusters (1984)                                      2181
Pulp Fiction (1994)                                      2171
Terminator, The (1984)                                   2098
Toy Story (1995)                                         2077
                                                         ...
Fausto (1993)                                               1
Five Wives, Three Secretaries and Me (1998)                 1
Small Faces (1995)                                          1
Somewhere in the City (1997)                                1
Anna (1996)                                                 1
Alley Cats, The (1968)                                      1
Fantastic Night, The (La Nuit Fantastique) (1949)           1
Running Free (2000)                                         1
Rhyme & Reason (1997)                                       1
Mutters Courage (1995)                                      1
Wooden Man's Bride, The (Wu Kui) (1994)                     1
For Ever Mozart (1996)                                      1
Death in Brunswick (1991)                                   1
Lay of the Land, The (1997)                                 1
Juno and Paycock (1930)                                     1
Soft Toilet Seats (1999)                                    1
McCullochs, The (1975)                                      1
Number Seventeen (1932)                                     1
Beauty (1998)                                               1
Outside Ozona (1998)                                        1
Windows (1980)                                              1
Waiting Game, The (2000)                                    1
Never Met Picasso (1996)                                    1
Choices (1981)                                              1
Ring, The (1927)                                            1
Eden (1997)                                                 1
Resurrection Man (1998)                                     1
Daens (1992)                                                1
Live Virgin (1999)                                          1
Schlafes Bruder (Brother of Sleep) (1995)                   1
Name: title, Length: 3706, dtype: int64